juan0fran/STM32L4_CC1101/src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V.
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other
  *    contributors to this software may be used to endorse or promote products
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under
  *    this license is void and will automatically terminate your rights under
  *    this license.
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"

/* USER CODE BEGIN Includes */

#include "freertos_util.h"
#include "cc1101_routine.h"
#include "command_parser.h"
#include "utils.h"
#include "of_reed-solomon_gf_2_m.h"
#include "link_layer.h"
#include "simple_link.h"
#include "eeprom.h"
#include "housekeeping.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c2;

IWDG_HandleTypeDef hiwdg;

SPI_HandleTypeDef hspi1;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart1_tx;

TaskHandle_t    tasks_ids[4];
uint32_t        tasks_full_stack[4];

static simple_link_packet_t control_packet;
static comms_hk_data_t comms_data;

TaskHandle_t ControlTaskHandle;
uint32_t ControlTaskBuffer[ 512 ];
StaticTask_t ControlTaskControlBlock;

TaskHandle_t CommsTaskHandle;
uint32_t CommsBuffer[ 1024 ];
StaticTask_t CommsControlBlock;

TaskHandle_t CommsTxTaskHandle;
uint32_t CommsTxBuffer[ 256 ];
StaticTask_t CommsTxControlBlock;

TaskHandle_t InterfaceTaskHandle;
uint32_t InterfaceBuffer[ 512 ];
StaticTask_t InterfaceControlBlock;

QueueHandle_t UartQueueTxHandle;
uint8_t UartQueueTxBuffer[ 4096 * sizeof( uint8_t ) ];
StaticQueue_t UartQueueTxControlBlock;

QueueHandle_t UartQueueRxHandle;
uint8_t UartQueueRxBuffer[ 4096 * sizeof( uint8_t ) ];
StaticQueue_t UartQueueRxControlBlock;

simple_link_packet_t LinkLayerRxBuffer[ 12 ];
StaticQueue_t LinkLayerRxControlBlock;
QueueHandle_t LinkLayerRxQueueHandle;

simple_link_packet_t RadioPacketTxBuffer[ 4 ];
StaticQueue_t RadioPacketTxControlBlock;
QueueHandle_t RadioPacketTxQueueHandle;

simple_link_packet_t ControlPacketBuffer[ 2 ];
StaticQueue_t ControlPacketControlBlock;
QueueHandle_t ControlPacketQueueHandle;

StaticSemaphore_t SimpleLinkMutexControlBlock;
SemaphoreHandle_t SimpleLinkMutexHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_I2C2_Init(void);
static void MX_ADC1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_IWDG_Init(void);
void ControlFunc(void const * argument);
void CommsFunc(void const * argument);
void CommsTxFunc(void const * argument);
void InterfaceFunc(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_I2C2_Init();
  MX_ADC1_Init();
  MX_USART1_UART_Init();
  //MX_IWDG_Init();

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

