juan0fran/STM32L4_CC1101/src/main.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    portBASE_TYPE taskWoken = pdFALSE;

    uint16_t i, pos, len;
    /* Read from last readed position to FULL */
    len = DMA_BUFFER_SIZE - dma_control.prevCNDTR;

    if (len > 0) {
        for (i = 0, pos = dma_control.prevCNDTR; i < len; i++, pos++) {
            if (pos >= DMA_BUFFER_SIZE) {
                _Error_Handler(__FILE__, __LINE__);
            }
            if (xQueueSendFromISR(UartQueueRxHandle, &dma_control.buffer[pos], &taskWoken) != pdTRUE) {
                _Error_Handler(__FILE__, __LINE__);
            } else {
                portEND_SWITCHING_ISR(taskWoken);
            }
        }
        dma_control.prevCNDTR = 0;
        if (xTaskNotifyFromISR(InterfaceTaskHandle, IFACE_NOTIFY_RX, eSetBits, &xHigherPriorityTaskWoken) != pdTRUE) {
            _Error_Handler(__FILE__, __LINE__);
        }
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}

void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    portBASE_TYPE taskWoken = pdFALSE;

    uint16_t i, pos, len;
    /* Read from last readed position to HALF */
    len = DMA_BUFFER_SIZE_HALF - dma_control.prevCNDTR;

    if (len > 0) {
        for (i = 0, pos = dma_control.prevCNDTR; i < len; i++, pos++) {
            if (pos >= DMA_BUFFER_SIZE) {
                _Error_Handler(__FILE__, __LINE__);
            }
            if (xQueueSendFromISR(UartQueueRxHandle, &dma_control.buffer[pos], &taskWoken) != pdTRUE) {
                _Error_Handler(__FILE__, __LINE__);
            } else {
                portEND_SWITCHING_ISR(taskWoken);
            }
        }
        dma_control.prevCNDTR = DMA_BUFFER_SIZE_HALF;
        if (xTaskNotifyFromISR(InterfaceTaskHandle, IFACE_NOTIFY_RX, eSetBits, &xHigherPriorityTaskWoken) != pdTRUE) {
            _Error_Handler(__FILE__, __LINE__);
        }
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}


void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if(xTaskNotifyFromISR(InterfaceTaskHandle, IFACE_NOTIFY_ERROR, eSetBits, &xHigherPriorityTaskWoken) == pdTRUE) {
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if(xTaskNotifyFromISR(InterfaceTaskHandle, IFACE_NOTIFY_TX_END, eSetBits, &xHigherPriorityTaskWoken) == pdTRUE) {
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}


void ReturnHKData(comms_hk_data_t *data)
{
    taskENTER_CRITICAL();
    memcpy(data, &comms_data, sizeof(comms_hk_data_t));
    taskEXIT_CRITICAL();
}

void GetModuleHKData(comms_hk_data_t *data)
{
    int i;
    cc1101_external_info_t cc1101_info;

    refresh_housekeeping();
    data->housekeeping.ext_temp = convert_temp_f_u16(get_external_temperature());
    data->housekeeping.int_temp = convert_temp_f_u16(get_internal_temperature());
    for (i = 0; i < 4; i++) {
            data->control.free_stack[i] = uxTaskGetStackHighWaterMark(tasks_ids[i]);
        }
    for (i = 0; i < 4; i++) {
        data->control.used_stack[i] = tasks_full_stack[i] - data->control.free_stack[i];
    }
    taskENTER_CRITICAL();
    data->housekeeping.ll_rx_packets = link_layer_info.decoded_packets;
    data->housekeeping.ll_tx_packets = link_layer_info.encoded_packets;
    get_cc1101_statistics(&cc1101_info);
    taskEXIT_CRITICAL();

    data->control.tx_remaining = uxQueueSpacesAvailable(RadioPacketTxQueueHandle);
    data->control.rx_queued = uxQueueMessagesWaiting(LinkLayerRxQueueHandle);

    data->housekeeping.phy_tx_failed_packets = cc1101_info.packet_not_tx_count%65536;
    data->housekeeping.phy_rx_packets = cc1101_info.packet_rx_count;
    data->housekeeping.phy_rx_errors = cc1101_info.packet_errors_corrected%65536;
    data->housekeeping.phy_tx_packets = cc1101_info.packet_tx_count;

    data->housekeeping.last_rssi = cc1101_info.last_rssi;
    data->housekeeping.last_lqi = cc1101_info.last_lqi;
    data->housekeeping.actual_rssi = cc1101_info.actual_rssi;
    data->housekeeping.transmit_power = 0;

}

int spi_transfer(uint8_t * ptx, uint8_t * prx, uint8_t len){
    uint32_t spinlock_protection = 0;
    HAL_GPIO_WritePin(CC1101_CS_GPIO_Port, CC1101_CS_Pin, GPIO_PIN_RESET);
    while(HAL_GPIO_ReadPin(CC1101_GDO1_GPIO_Port, CC1101_GDO1_Pin) != 0 && ++spinlock_protection < 10000);
    if (spinlock_protection >= 10000){
        return -1;
    }
    if (HAL_SPI_TransmitReceive(&hspi1, ptx, prx, len, HAL_MAX_DELAY) == HAL_OK){
        HAL_GPIO_WritePin(CC1101_CS_GPIO_Port, CC1101_CS_Pin, GPIO_PIN_SET);
        return 0;
    }else{
        HAL_GPIO_WritePin(CC1101_CS_GPIO_Port, CC1101_CS_Pin, GPIO_PIN_SET);
        return -1;
    }
}

void PreSleepProcessing(uint32_t *ulExpectedIdleTime);
void PostSleepProcessing(uint32_t *ulExpectedIdleTime);

/* GetIdleTaskMemory prototype (linked to static allocation support) */
void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize );

/* Hook prototypes */

/* USER CODE BEGIN PREPOSTSLEEP */
__weak void PreSleepProcessing(uint32_t *ulExpectedIdleTime)
{
/* place for user code */
}

__weak void PostSleepProcessing(uint32_t *ulExpectedIdleTime)
{
/* place for user code */
}
/* USER CODE END PREPOSTSLEEP */

/* USER CODE BEGIN GET_IDLE_TASK_MEMORY */
static StaticTask_t xIdleTaskTCBBuffer;
static StackType_t xIdleStack[configMINIMAL_STACK_SIZE];

void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize )
{
  *ppxIdleTaskTCBBuffer = &xIdleTaskTCBBuffer;
  *ppxIdleTaskStackBuffer = &xIdleStack[0];
  *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
  /* place for user code */
}
/* USER CODE END GET_IDLE_TASK_MEMORY */


/* USER CODE END 4 */

/* ControlFunc function */
void ControlFunc(void const * argument)
{

