juan0fran/STM32L4_CC1101/src/main.c
  /* USER CODE BEGIN 5 */
  int ret;
  check_for_printf_buffer();
  /* Infinite loop */
  for(;;)
  {
      tasks_ids[0] = ControlTaskHandle;
      tasks_ids[1] = CommsTaskHandle;
      tasks_ids[2] = CommsTxTaskHandle;
      tasks_ids[3] = InterfaceTaskHandle;

      tasks_full_stack[0] = (sizeof(ControlTaskBuffer)/sizeof(uint32_t));
      tasks_full_stack[1] = (sizeof(CommsBuffer)/sizeof(uint32_t));
      tasks_full_stack[2] = (sizeof(CommsTxBuffer)/sizeof(uint32_t));
      tasks_full_stack[3] = (sizeof(InterfaceBuffer)/sizeof(uint32_t));

      init_housekeeping();
      /* Just OSDelay here to set all variables up */
      vTaskDelay(1);
      for(;;) {
          if (xQueueReceive(ControlPacketQueueHandle, &control_packet, 5000) == pdTRUE) {
              /* Control packet asks for GetModuleHKData */
              GetModuleHKData(&comms_data);
              ret = set_simple_link_packet(&comms_data, sizeof(comms_data), configuration_frame, 0, &control_packet);
              send_kiss_packet(0, &control_packet, ret);
          }
      }
  }
  /* USER CODE END 5 */
}

/* CommsFunc function */
void CommsFunc(void const * argument)
{
  /* USER CODE BEGIN CommsFunc */
  /* Infinite loop */
  check_for_printf_buffer();
  for(;;)
  {
	  vTaskDelay(1);
      cc1101_work();
  }
  /* USER CODE END CommsFunc */
}

/* CommsTxFunc function */
void CommsTxFunc(void const * argument)
{
  /* USER CODE BEGIN CommsTxFunc */
  /* Infinite loop */
  check_for_printf_buffer();
  for(;;)
  {
	  vTaskDelay(1);
      csma_tx_work();
  }
  /* USER CODE END CommsTxFunc */
}

/* InterfaceFunc function */
void InterfaceFunc(void const * argument)
{
  /* USER CODE BEGIN InterfaceFunc */
  /* Infinite loop */
  check_for_printf_buffer();
  for(;;)
  {
	  vTaskDelay(1);
      usart_work();
  }
  /* USER CODE END InterfaceFunc */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM17 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM17) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
